Autodesk.Revit.DB.DefinitionFile.Filename
This property returns the physical filename of the shared parameters file on disk.

Autodesk.Revit.DB.DefinitionFile.Groups
Return a map of shared parameter definition groups contained within the file.
Remarks: A particular group can be found by Name, using the Item property on the DefinitionGroups
object. A new group can be created by using the Create method on the DefinitionGroups Object.
The Create method takes the name of the new group, as a string, as its input parameter, returning
a reference to a new definition group object as its result.

Autodesk.Revit.DB.DefinitionFile
The DefinitionFile object represents a shared parameters file on disk.
Remarks: Shared Parameters are parameter definitions that are stored in a text file
external to the Autodesk Revit project. These definitions can be used in multiple projects
and are identifiable by a unique identifier generated when they are created. API access to
shared parameters consist of a number of objects, the first of which is an object that
represents the shared parameters file on disk. That object then contains a number of Group
objects. Shared parameters are grouped for easier management. These groups then contain the
shared parameter definitions. The groups support the ability to create new shared
parameter definitions. The DefinitionFile object can be retrieved by the
Application.OpenSharedParameterFile method.